#include "menu.h"
/************************
【函数名】outputMenu
【功能】输出系统菜单
【参数】void
【返回值】void
*************************/
void outputMenu()
{
	printf("--------------菜单------------\n");
	printf("1.添加卡\n");
	printf("2.查询卡\n");
	printf("3.上机\n");
	printf("4.下机\n");
	printf("5.充值\n");
	printf("6.退费\n");
	printf("7.查询统计\n");
	printf("8.注销卡\n");
	printf("0.退出\n");
	printf("请输入菜单编号(0~8):");
}
/************************
【函数名】add
【功能】添加卡
【参数】void
【返回值】void
*************************/
void add()
{
	printf("--------添加卡--------\n");
	printf("请输入卡号<长度1~18>:\n");
	printf("请输入密码<长度1~8>:\n");
	printf("请输入开卡金额<RMB>:\n");
	printf("添加卡信息成功！\n");
}
/************************
【函数名】query
【功能】查询卡
【参数】void
【返回值】void
*************************/
void query()
{
	printf("请输入查询卡卡号：");
}
/************************
【函数名】exitApp
【功能】退出系统
【参数】void
【返回值】void
*************************/
void exitApp()
{
	printf("你确定退出系统吗？？？<请选择1或者2>\n");
	printf("1.确定 2.取消");
}
/************************
【函数名】logon
【功能】上机
【参数】void
【返回值】void
*************************/
void logon()
{
	printf("上机时间：");
}
/************************
【函数名】settle
【功能】下机
【参数】void
【返回值】void
*************************/
void settle()
{
	printf("下机时间：");
}
/************************
【函数名】annul
【功能】注销卡
【参数】void
【返回值】void
*************************/
void annul()
{
	printf("你确定注销卡吗？？？<请选择1或者2>\n");
	printf("1.确定 2.取消");
}
/************************
【函数名】addMoney
【功能】充值
【参数】void
【返回值】void
*************************/
void addMoney()
{
	printf("请输入充值金额:<RMB>:");
}
/************************
【函数名】refunMoney
【功能】退费
【参数】void
【返回值】void
*************************/
void refunMoney()
{
	printf("退费金额<RMB>:");
}
/************************
【函数名】count
【功能】查询统计
【参数】void
【返回值】void
*************************/
void count()
{}
